doit132/cmake_stm32_gcc_template/components/libraries/STM32F10x_StdPeriph_Lib_V3.6.0/CMSIS/src/system_stm32f10x_template.c
/**
 ******************************************************************************
 * @file    system_stm32f10x.c
 * @author  MCD Application Team
 * @version V3.5.1
 * @date    08-September-2021
 * @brief   CMSIS Cortex-M3 Device Peripheral Access Layer System Source File.
 *
 * 1.  This file provides two functions and one global variable to be called from
 *     user application:
 *      - SystemInit(): Setups the system clock (System clock source, PLL Multiplier
 *                      factors, AHB/APBx prescalers and Flash settings).
 *                      This function is called at startup just after reset and
 *                      before branch to main program. This call is made inside
 *                      the "startup_stm32f10x_xx.s" file.
 *
 *      - SystemCoreClock variable: Contains the core clock (HCLK), it can be used
 *                                  by the user application to setup the SysTick
 *                                  timer or configure other parameters.
 *
 *      - SystemCoreClockUpdate(): Updates the variable SystemCoreClock and must
 *                                 be called whenever the core clock is changed
 *                                 during program execution.
 *
 * 2. After each device reset the HSI (8 MHz) is used as system clock source.
 *    Then SystemInit() function is called, in "startup_stm32f10x_xx.s" file, to
 *    configure the system clock before to branch to main program.
 *
 * 3. If the system clock source selected by user fails to startup, the SystemInit()
 *    function will do nothing and HSI still used as system clock source. User can
 *    add some code to deal with this issue inside the SetSysClock() function.
 *
 * 4. The default value of HSE crystal is set to 8 MHz (or 25 MHz, depedning on
 *    the product used), refer to "HSE_VALUE" define in "stm32f10x.h" file.
 *    When HSE is used as system clock source, directly or through PLL, and you
 *    are using different crystal you have to adapt the HSE value to your own
 *    configuration.
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2011 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/** @addtogroup CMSIS
 * @{
 */

/** @addtogroup stm32f10x_system
 * @{
 */

/** @addtogroup STM32F10x_System_Private_Includes
 * @{
 */

#include "stm32f10x.h"

/**
 * @}
 */

/** @addtogroup STM32F10x_System_Private_TypesDefinitions
 * @{
 */

/**
 * @}
 */

/** @addtogroup STM32F10x_System_Private_Defines
 * @{
 */

/*!< Uncomment the line corresponding to the desired System clock (SYSCLK)
   frequency (after reset the HSI is used as SYSCLK source)

   IMPORTANT NOTE:
   ==============
   1. After each device reset the HSI is used as System clock source.

   2. Please make sure that the selected System clock doesn't exceed your device's
      maximum frequency.

   3. If none of the define below is enabled, the HSI is used as System clock
    source.

   4. The System clock configuration functions provided within this file assume that:
	- For Low, Medium and High density Value line devices an external 8MHz
	  crystal is used to drive the System clock.
	- For Low, Medium and High density devices an external 8MHz crystal is
	  used to drive the System clock.
	- For Connectivity line devices an external 25MHz crystal is used to drive
	  the System clock.
     If you are using different crystal you have to adapt those functions accordingly.
    */

#if defined(STM32F10X_LD_VL) || (defined STM32F10X_MD_VL) || (defined STM32F10X_HD_VL)
/* #define SYSCLK_FREQ_HSE    HSE_VALUE */
	#define SYSCLK_FREQ_24MHz 24000000
#else
	/* #define SYSCLK_FREQ_HSE    HSE_VALUE */
	/* #define SYSCLK_FREQ_24MHz  24000000 */
	/* #define SYSCLK_FREQ_36MHz  36000000 */
	/* #define SYSCLK_FREQ_48MHz  48000000 */
	/* #define SYSCLK_FREQ_56MHz  56000000 */
	#define SYSCLK_FREQ_72MHz 72000000
#endif

/*!< Uncomment the following line if you need to use external SRAM mounted
     on STM3210E-EVAL board (STM32 High density and XL-density devices) or on
     STM32100E-EVAL board (STM32 High-density value line devices) as data memory */
#if defined(STM32F10X_HD) || (defined STM32F10X_XL) || (defined STM32F10X_HD_VL)
/* #define DATA_IN_ExtSRAM */
#endif

/*!< Uncomment the following line if you need to relocate your vector Table in
     Internal SRAM. */
/* #define VECT_TAB_SRAM */
#define VECT_TAB_OFFSET                                                                            \
	0x0 /*!< Vector Table base offset field.                                                   \
				  This value must be a multiple of 0x200. */

/**
 * @}
 */

/** @addtogroup STM32F10x_System_Private_Macros
 * @{
 */

/**
 * @}
 */

/** @addtogroup STM32F10x_System_Private_Variables
 * @{
 */

/*******************************************************************************
 *  Clock Definitions
 *******************************************************************************/
#ifdef SYSCLK_FREQ_HSE
uint32_t SystemCoreClock = SYSCLK_FREQ_HSE; /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_24MHz
uint32_t SystemCoreClock = SYSCLK_FREQ_24MHz; /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_36MHz
uint32_t SystemCoreClock = SYSCLK_FREQ_36MHz; /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_48MHz
uint32_t SystemCoreClock = SYSCLK_FREQ_48MHz; /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_56MHz
uint32_t SystemCoreClock = SYSCLK_FREQ_56MHz; /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_72MHz
uint32_t SystemCoreClock = SYSCLK_FREQ_72MHz; /*!< System Clock Frequency (Core Clock) */
#else /*!< HSI Selected as System Clock source */
uint32_t SystemCoreClock = HSI_VALUE; /*!< System Clock Frequency (Core Clock) */
#endif

__I uint8_t AHBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
/**
 * @}
 */

/** @addtogroup STM32F10x_System_Private_FunctionPrototypes
 * @{
 */

static void SetSysClock(void);

#ifdef SYSCLK_FREQ_HSE
static void SetSysClockToHSE(void);
#elif defined SYSCLK_FREQ_24MHz
static void SetSysClockTo24(void);
#elif defined SYSCLK_FREQ_36MHz
static void SetSysClockTo36(void);
#elif defined SYSCLK_FREQ_48MHz
static void SetSysClockTo48(void);
#elif defined SYSCLK_FREQ_56MHz
static void SetSysClockTo56(void);
#elif defined SYSCLK_FREQ_72MHz
static void SetSysClockTo72(void);
#endif

