doit132/cmake_stm32_gcc_template/components/libraries/STM32F10x_StdPeriph_Lib_V3.6.0/CMSIS/src/system_stm32f10x_template.c
			/* Get PREDIV1 clock source and division factor */
			prediv1source = RCC->CFGR2 & RCC_CFGR2_PREDIV1SRC;
			prediv1factor = (RCC->CFGR2 & RCC_CFGR2_PREDIV1) + 1;

			if (prediv1source == 0) {
				/* HSE oscillator clock selected as PREDIV1 clock entry */
				SystemCoreClock = (HSE_VALUE / prediv1factor) * pllmull;
			} else { /* PLL2 clock selected as PREDIV1 clock entry */

				/* Get PREDIV2 division factor and PLL2 multiplication factor */
				prediv2factor = ((RCC->CFGR2 & RCC_CFGR2_PREDIV2) >> 4) + 1;
				pll2mull = ((RCC->CFGR2 & RCC_CFGR2_PLL2MUL) >> 8) + 2;
				SystemCoreClock =
					(((HSE_VALUE / prediv2factor) * pll2mull) / prediv1factor) *
					pllmull;
			}
		}
#endif /* STM32F10X_CL */
		break;

	default:
		SystemCoreClock = HSI_VALUE;
		break;
	}

	/* Compute HCLK clock frequency ----------------*/
	/* Get HCLK prescaler */
	tmp = AHBPrescTable[((RCC->CFGR & RCC_CFGR_HPRE) >> 4)];
	/* HCLK clock frequency */
	SystemCoreClock >>= tmp;
}

/**
 * @brief  Configures the System clock frequency, HCLK, PCLK2 and PCLK1 prescalers.
 * @param  None
 * @retval None
 */
static void SetSysClock(void)
{
#ifdef SYSCLK_FREQ_HSE
	SetSysClockToHSE();
#elif defined SYSCLK_FREQ_24MHz
	SetSysClockTo24();
#elif defined SYSCLK_FREQ_36MHz
	SetSysClockTo36();
#elif defined SYSCLK_FREQ_48MHz
	SetSysClockTo48();
#elif defined SYSCLK_FREQ_56MHz
	SetSysClockTo56();
#elif defined SYSCLK_FREQ_72MHz
	SetSysClockTo72();
#endif

	/* If none of the define above is enabled, the HSI is used as System clock
    source (default after reset) */
}

/**
 * @brief  Setup the external memory controller. Called in startup_stm32f10x.s
 *          before jump to __main
 * @param  None
 * @retval None
 */
#ifdef DATA_IN_ExtSRAM
/**
 * @brief  Setup the external memory controller.
 *         Called in startup_stm32f10x_xx.s/.c before jump to main.
 * 	      This function configures the external SRAM mounted on STM3210E-EVAL
 *         board (STM32 High density devices). This SRAM will be used as program
 *         data memory (including heap and stack).
 * @param  None
 * @retval None
 */
void SystemInit_ExtMemCtl(void)
{
	/*!< FSMC Bank1 NOR/SRAM3 is used for the STM3210E-EVAL, if another Bank is
  required, then adjust the Register Addresses */

	/* Enable FSMC clock */
	RCC->AHBENR = 0x00000114;

	/* Enable GPIOD, GPIOE, GPIOF and GPIOG clocks */
	RCC->APB2ENR = 0x000001E0;

	/* ---------------  SRAM Data lines, NOE and NWE configuration ---------------*/
	/*----------------  SRAM Address lines configuration -------------------------*/
	/*----------------  NOE and NWE configuration --------------------------------*/
	/*----------------  NE3 configuration ----------------------------------------*/
	/*----------------  NBL0, NBL1 configuration ---------------------------------*/

	GPIOD->CRL = 0x44BB44BB;
	GPIOD->CRH = 0xBBBBBBBB;

	GPIOE->CRL = 0xB44444BB;
	GPIOE->CRH = 0xBBBBBBBB;

	GPIOF->CRL = 0x44BBBBBB;
	GPIOF->CRH = 0xBBBB4444;

	GPIOG->CRL = 0x44BBBBBB;
	GPIOG->CRH = 0x44444B44;

	/*----------------  FSMC Configuration ---------------------------------------*/
	/*----------------  Enable FSMC Bank1_SRAM Bank ------------------------------*/

	FSMC_Bank1->BTCR[4] = 0x00001011;
	FSMC_Bank1->BTCR[5] = 0x00000200;
}
#endif /* DATA_IN_ExtSRAM */

#ifdef SYSCLK_FREQ_HSE
/**
 * @brief  Selects HSE as System clock source and configure HCLK, PCLK2
 *         and PCLK1 prescalers.
 * @note   This function should be used only after reset.
 * @param  None
 * @retval None
 */
static void SetSysClockToHSE(void)
{
	__IO uint32_t StartUpCounter = 0, HSEStatus = 0;

	/* SYSCLK, HCLK, PCLK2 and PCLK1 configuration ---------------------------*/
	/* Enable HSE */
	RCC->CR |= ((uint32_t)RCC_CR_HSEON);

	/* Wait till HSE is ready and if Time out is reached exit */
	do {
		HSEStatus = RCC->CR & RCC_CR_HSERDY;
		StartUpCounter++;
	} while ((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

	if ((RCC->CR & RCC_CR_HSERDY) != RESET) {
		HSEStatus = (uint32_t)0x01;
	} else {
		HSEStatus = (uint32_t)0x00;
	}

	if (HSEStatus == (uint32_t)0x01) {
	#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL && !defined STM32F10X_HD_VL
		/* Enable Prefetch Buffer */
		FLASH->ACR |= FLASH_ACR_PRFTBE;

		/* Flash 0 wait state */
		FLASH->ACR &= (uint32_t)((uint32_t)~FLASH_ACR_LATENCY);

		#ifndef STM32F10X_CL
		FLASH->ACR |= (uint32_t)FLASH_ACR_LATENCY_0;
		#else
		if (HSE_VALUE <= 24000000) {
			FLASH->ACR |= (uint32_t)FLASH_ACR_LATENCY_0;
		} else {
			FLASH->ACR |= (uint32_t)FLASH_ACR_LATENCY_1;
		}
		#endif /* STM32F10X_CL */
	#endif

		/* HCLK = SYSCLK */
		RCC->CFGR |= (uint32_t)RCC_CFGR_HPRE_DIV1;

		/* PCLK2 = HCLK */
		RCC->CFGR |= (uint32_t)RCC_CFGR_PPRE2_DIV1;

		/* PCLK1 = HCLK */
		RCC->CFGR |= (uint32_t)RCC_CFGR_PPRE1_DIV1;

		/* Select HSE as system clock source */
		RCC->CFGR &= (uint32_t)((uint32_t) ~(RCC_CFGR_SW));
		RCC->CFGR |= (uint32_t)RCC_CFGR_SW_HSE;

		/* Wait till HSE is used as system clock source */
		while ((RCC->CFGR & (uint32_t)RCC_CFGR_SWS) != (uint32_t)0x04) {
		}
	} else { /* If HSE fails to start-up, the application will have wrong clock
	 configuration. User can add here some code to deal with this error */
	}
}
#elif defined SYSCLK_FREQ_24MHz
/**
 * @brief  Sets System clock frequency to 24MHz and configure HCLK, PCLK2
 *         and PCLK1 prescalers.
 * @note   This function should be used only after reset.
 * @param  None
 * @retval None
 */
static void SetSysClockTo24(void)
{
	__IO uint32_t StartUpCounter = 0, HSEStatus = 0;

	/* SYSCLK, HCLK, PCLK2 and PCLK1 configuration ---------------------------*/
	/* Enable HSE */
	RCC->CR |= ((uint32_t)RCC_CR_HSEON);

	/* Wait till HSE is ready and if Time out is reached exit */
	do {
		HSEStatus = RCC->CR & RCC_CR_HSERDY;
		StartUpCounter++;
	} while ((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

